{"Sun": "\nSun: The Planet of Self\nAs the sun puts forth light, so it brings forth life. This planet (also known as a luminary and a star) represents the self, one’s personality and ego, the spirit and what it is that makes the individual unique. It is our identity and our face to the world. The sun also speaks to creative ability and the power of the individual to meet the challenges of everyday life.\nOne’s natural father, husband and other male influences are ruled by the sun, as are children. The sun’s energy is a forceful one, and in its wake comes authority, the ability to lead and an individual’s essence, their core being. Through the will of this planet, we learn to manifest ourselves in the world.\nThe sun is majestic, and in ke/Users/chaimilee/Desktop/planet_info.jsoneping with its regal air, it rules royalty and higher office. This orb also lords over our health and well-being. The sun’s golden glow is a vital life force which imbues us with strength, energy, and a will to succeed. It is the sun that gives strength to the other planets, which is why this planet occupies a key role in astrology.\nThe sun spends about a month visiting each sign and takes a year to journey through the 12 signs of the zodiac. It is masculine energy and rules Leo and the fifth house.\n", "Moon": "\nThe Moon: Ruler of Emotions\nSince the Moon is the closest ‘planet’ to Earth, this satellite literally zips around the zodiac, completing its circuit in less than a month. It also touches us more deeply than most planets.\nAs the ruler of the tides, it is fitting that the Moon should be the ruler of our emotions. Still waters run deep? Making waves? A wellspring of emotion? Yes, our emotions have long been portrayed in terms of the sea: fluid, momentous, churning from within. Mood swings, instinct, how we feel about things and how our feelings affect others are all influenced by the Moon. Whereas the Sun gives us our spirit, it’s the Moon that gives us our soul.\nThe Moon is goddess-like in that it symbolizes mother and the relationship between woman and child. This planet (also known as a luminary) speaks to the women in one’s life and their role as nurturer. Fertility, pregnancy and childbirth are also governed by the Moon. We see the Moon casting its silvery glow from our earliest moments, when we were stroked and caressed by our mother and felt her tender touch.\nOur emotions manifest themselves through our being and set the tone for our daily lives. The Moon is party to this continuum, rendering us vital one moment and fragile the next. We’re up and down, naughty or nice, and may laugh wildly or cry at will. Through the Moon’s energy, we endeavor to reconcile these varied emotions in order to make ourselves complete and one with the world. The Moon also helps us see that which we want, and to use memory and the past as part of this process.\nThe Moon spends roughly 2 1/2 days in each sign and takes 28 days to circumnavigate the zodiac. It is feminine energy and rules Cancer and the Fourth House.\n", "Mercury": "\nMercury: The Planet of Communication\nMercury, much like the winged messenger of the gods, comes in on feather-light wings and commands us to speak. Communication, intellect and awareness are all within Mercury’s domain, as are logic and reasoning, our manner of thinking, and how we create and express our thought processes.\n\nA mercurial nature brings to mind restlessness and motion. Rat-a-tat-tat — things happen fast here. Mercury is about a quick wit, quick thinking, possibilities, opinions, reasoning and the ability to rationalize things. Mercurial energy can be good or bad, but it will certainly be energizing! This planet also prompts us to move from one thing to the next and to get answers on both a physical and psychological level. Further, Mercury’s energy is both dexterous and perceptive.\nMercury is about short trips: a visit to a neighbor or a friend across town, the workaday commute, a weekend getaway. Siblings, and transportation in general, are also within Mercury’s realm.\nSpeaking, writing, books, online communications and learning are all within Mercury’s domain. This planet implores us to express ourselves often — and well. When Mercury goes retrograde (the appearance of traveling backward), however, our communications will be challenged.\nMercury is never more than 28 degrees from the Sun; it takes about 88 days to complete its orbit of the Sun. It is neither masculine nor feminine energy and assumes the gender of the sign it is in. It rules both Gemini and Virgo, and the Third and Sixth Houses.\n", "Venus": "\nVenus: The Planet of Love and Money\nVenus is all about pleasure, especially pleasure shared with someone else. This planet concerns itself with love, romance and harmony in our emotional attachments, marriages, friendships and other unions (like business partnerships). Venus is content to spread happiness and tenderness, all the while teaching us how to love and appreciate others and the things that we possess.\nWe appear attractive — and we attract others — thanks to Venus’s energy. Socializing with and relating to others are important to this planet.\nBeauty is also strongly associated with Venus. The arts (music, dance, drama and literature, to name a few) and a sense of the aesthetic fall within the realm of Venus. Venus beseeches us to indulge our senses and revel in the beauty of our world. This planet is inextricably linked to refinement, culture, charm and grace.\nVenus also deals with the pleasure we derive from our possessions. Luxuries (jewelry, paintings, expensive cars), good food and drink, a beautiful home and a sense of refinement all please Venus’s interests. This planet asks us to appreciate the exquisite nature of things. It’s a sensual — though not necessarily sexual — world as far as Venus is concerned.\nVenus takes 225 days to complete its orbit of the zodiac; it is never more than 47 degrees from the Sun. It is a feminine energy and rules both Taurus and Libra, and the Second and Seventh Houses.\n", "Mars": "\nMars: The Planet of Passion\nMars is the action planet of the zodiac. The ‘Red Planet,’ after all, should be pretty fiery, and Mars does not disappoint. Energy, passion, drive and determination are all right up Mars’s alley. This planet commands you (and yes, Mars does rule the military) to stand up, be noticed and get things done — sitting on the sidelines belongs somewhere else in the heavens. Simply put, Mars speaks to the power and confident expression of the individual.\n\nAmbition and competition are also within Mars’s realm. Whether it’s at work or on the field of play, Mars encourages us to face challenges and to be our best — or better. Aggression is part of the plan here, although Mars also values courage and honor. Assertion and a daring, fearless nature please this planet.\nIt’s important to note that Mars’s energy can be constructive or destructive. The God of War in ancient times, Mars could be brutally violent. While this energy still emanates from the planet, it also asks us to harness this force for good. Stamina, ambition and achievement are all part of Mars’ mantra.\nMars rules our sexuality and sexual energy, and governs weapons, accidents and surgery (the last two illustrating the yin and yang nature of this planet). In the end, however, the energy of Mars can be quite useful if used properly.\nIt takes nearly two years for Mars to complete its orbit through the zodiac. It is masculine energy and rules both Aries and Scorpio, and the First and Eighth Houses.\n", "Jupiter": "\nJupiter: The Planet of Luck\nJupiter is the thinking-person’s planet. As the guardian of the abstract mind, this planet rules higher learning, and bestows upon us a yen for exploring ideas, both intellectually and spiritually. Intellectually speaking, Jupiter assists us in formulating our ideology. In the more spiritual realm, Jupiter lords over religions and philosophy. A search for the answers is what Jupiter proposes, and if it means spanning the globe to find them, well, that’s probably why Jupiter also rules long-distance travel. In keeping with this theme, Jupiter compels us to assess our ethical and moral values; it also addresses our sense of optimism.\nLuck and good fortune are associated with Jupiter for good reason. This is a kind and benevolent planet, one that wants us to grow and flourish in a positive way. Jupiter may be judge and jury, but it’s mostly an honorable helpmate, seeing to it that we’re on the right path. While our success, accomplishments and prosperity are all within Jupiter’s realm, this largesse can, at times, deteriorate into laziness and sloth (Jupiter, at its worst, is associated with weight gain!). More often than not, however, Jupiter will guide us down the primrose path.\nLeisure time is also one of Jupiter’s pastimes. Sports of all kinds, games of chance and a stroll in the park with the family pet (Jupiter loves animals) –- these are all ruled by this planet. Finally, Jupiter often presages great wealth, material and otherwise. This is a good friend in the heavens!\nIt takes Jupiter about 12 years to circle the zodiac (the planet visits an average of one sign a year). It is masculine energy and rules both Sagittarius and Pisces, and the Ninth and Twelfth Houses.\n", "Saturn": "\nSaturn: The Planet of Karma\nSaturn doesn’t make things easy. That’s the role of the taskmaster of the zodiac. Saturn commands us to get to work and to work hard. Discipline and responsibility are important to this planet, yet if we’re eager to conquer the world, that’s okay, too.\nMuch like Father Time, Saturn implores us to look at the clock (its glyph, after all, is the sickle of Chronos, the God of Time). Is there time for everything we want to do, or are there limits? Those limitations are important to Saturn, and we must learn to manage them. Restrictions are the province of this planet, as is any form of discipline or delay.\nIn keeping with the passage of time, Saturn governs old age along with the lessons it teaches us. Learning life’s lessons is key to this planet, in keeping with its role as teacher. The majesty of older age also brings with it a certain sense of tradition, conventionality (our learned patterns of behavior) and wisdom, and Saturn is mindful of these characteristics. This planet applauds our perseverance and the fact that we’ve withstood the test of time (yes, time comes up once again). This senior status further brings with it a measure of authority, and Saturn lords over that as well.\nStructure, order and the way in which we conduct our affairs are all ruled by this ringed planet. Contraction and the reining in of assets are also important here. Lastly, Saturn, again in its role as teacher, concerns itself with karma and the lessons which past experiences might bring.\nIt takes Saturn 28-30 years to complete its orbit of the zodiac. It is masculine energy and rules both Capricorn and Aquarius, and the Tenth and Eleventh Houses.\n", "Uranus": "\nUranus: The Planet of Rebellion\nUranus wasn’t discovered until 1781. As one of the outermost planets, it moves rather slowly through the zodiac. The result is that its effect is felt more generationally than individually.\nUranus brings with it a new way of looking at things, and its approach is best met with an expanded consciousness. Originality, inventions, computers, cutting-edge technologies and future events are all ruled by this planet. Uranus sees no need for the status quo, preferring instead to break with tradition and create a new mold. While the building blocks (science, electricity) are safe here, this planet would rather focus its gaze on a new world order. To that end, rebellion, revolution, dictators, an autonomous state and free will all fall under the aegis of this planet.\nNo one will ever characterize Uranus as subtle. This is the planet that coaxes erratic and bizarre behavior and byzantine schemes. A bohemian, utopian society is more in keeping with Uranus’s bent, as are humanitarian ideals. Freedom and creativity are important to this planet; Astrology is also within its realm. Lastly, in keeping with its sudden, sometimes violent and often unexpected manner, Uranus rules earthquakes and other natural disasters.\nIt takes Uranus 84 years to complete its trip around the zodiac. It is an androgynous energy and rules Aquarius and the Eleventh House. Uranus is considered to be the higher octave of Mercury and the first of the transcendental planets.\n", "Neptune": "\nNeptune: The Planet of Illusion\nNeptune, another of the outer planets, was discovered in 1846. Its slow orbit around our zodiac ensures that its effect is generational in nature.\nNeptune’s glyph is the trident of Poseidon, God of the Seas. Much about this planet is fluid (Neptune rules the oceans of the Earth), changeable and illusory in nature. Dreams, illusion, abstract thought and the mysterious are all governed by Neptune. Our spirituality is important to this planet, and how we harness that energy for our personal betterment. Neptune invites us to let its energy wash over us and to use a meditative state to gain insights and heightened awareness. Poetry, music and dance are among the trance-like activities which this planet favors.\n\nNeptune does have its showier side, as it rules movies, television, theater, fashion and all forms of glamour. In essence, Neptune is creating an illusion — of what is enchanting on the outside and captivating within. Neptune has a mystique which doesn’t reveal itself easily. It can be a poser, too, dabbling in flattery — and subversion.\nThe shadow side of Neptune is akin to the aging star who cannot make one more curtain. When the lights are low, this planet plays in a netherworld of drugs, alcohol, trances and hypnosis. Neptunian energy reeks of escapism on its darker days, a sea of delusion, hypochondria and abnormality. Sleep and dreams are also lorded over by this planet. At the end of the day, Neptune keeps coming at you — how will you receive it?\nIt takes Neptune 165 years to complete its whirl around the zodiac, spending roughly 14 years at each sign. It is feminine energy and rules Pisces and the Twelfth House. Neptune is known as the higher octave of Venus and is the second of the transcendental planets.\n", "Pluto": "\nPluto: The Planet of Power\nAs the outermost planet in our solar system, Pluto is also the farthest from the Sun. It has only recently been discovered, having come to light (albeit a dim one) in 1930.\nPluto’s energy may be subtle, but its results will hit you like a ton of bricks. This planet is about transformation, regeneration and rebirth. Things aren’t pretty with Pluto, but they do get done. Pluto says ‘out with the old and in with the new,’ and we’d better be ready for it. If we’re not, this planet will simply have us wallow in our misery. Pluto asks us to transcend that which we know, redeem ourselves in the process, and come out stronger as a result.\nFor all that Pluto (re)creates (it also governs the reproductive system), it loves to destroy. This planet rules destruction, death, obsession, kidnapping, coercion, viruses and waste. That’s definitely not pretty. Pluto also governs crime and the underworld, along with many forms of subversive activity (terrorism, dictatorships). This planet is about all that is secret and undercover, that which is hidden from view. Is this the story of good vs. evil? Yes.\nNo one will deny Pluto’s power (it rules atomic power, too) and intensity. This planet’s energy is often focused on the masses and what the collective will do. Pluto beseeches the masses to look inward (and to their subconscious) to see what’s there. It may be scary, but Pluto doesn’t care. This planet knows how to push buttons.\nIt takes Pluto approximately 248 years to complete its orbit around the zodiac. Due to the eccentricity of its orbit, it takes this planet between 12 and 31 years to pass through a sign. It rules Scorpio and the Eighth House. Pluto is the last of the transcendental planets and is the higher octave of Mars.\n"}